Revit 2027 API
FabricArea Properties
The FabricArea type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CoverOffset |  The additional cover offset of the fabric distribution.
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Direction |  The Major Direction of the Fabric Area.
DirectionOrigin |  The Origin Point of the Major Direction of the Fabric Area.
DistributionOfWiresAtCover |  The distribution of wires that is closest to the cover.
Document | Returns the Document in which the Element resides.
(Inherited from Element)
FabricAreaType |  The type of the Fabric Area.
FabricLocation |  The Fabric location in the host.
FabricSheetTypeId |  The id of the Fabric Sheet Type for this element.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HostId |  The id of the Host element for the fabric area.
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LapSplicePosition |  The fabric lap splice position in the fabric distribution.
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
MajorLapSpliceLength |  The fabric lap splice length in the fabric distribution in the major direction.
MajorSheetAlignment |  The fabric sheet alignment in the fabric distribution in the major direction.
MinorLapSpliceLength |  The fabric lap splice length in the fabric distribution in the minor direction.
MinorSheetAlignment |  The fabric sheet alignment in the fabric distribution in the minor direction.
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
SketchId |  The id of the Sketch element for this element.
TagViewId |  The element of the view in which to tag new members of this element.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace